{
  "backend/main.mo": "Empty Motoko canister actor with no methods.",
  "feature_evidence.json": "Metadata describing a feature request to update the page title in frontend/index.html.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, dark mode tokens, and base theming.",
  "frontend/index.html": "HTML entry point setting the document title and mounting the React app.",
  "frontend/src/App.tsx": "Main React component managing navigation between six Valentine-themed steps.",
  "frontend/src/components/CalendarSticker.tsx": "Sticker component showing a calendar icon with a heart accent and romantic text.",
  "frontend/src/components/FloatingHeartsSparkles.tsx": "Generates animated floating hearts and sparkles with configurable density.",
  "frontend/src/components/HandwritingHeading.tsx": "Wrapper component applying a handwriting font to headings.",
  "frontend/src/components/KissStickerBurst.tsx": "Animated burst of heart-shaped kiss stickers with romantic text overlay.",
  "frontend/src/components/PinkEnvelope.tsx": "Interactive pink envelope that reveals a heartfelt letter when opened.",
  "frontend/src/components/PopupModal.tsx": "Modal shown after acceptance of the big question, with heart animation and next-step button.",
  "frontend/src/components/RedEnvelope.tsx": "Interactive red envelope component that toggles open to reveal custom content.",
  "frontend/src/components/ShareFooter.tsx": "Footer providing copy-link functionality and attribution section.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing the authenticated/anonymous backend actor instance.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file since no backend queries are used.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables, custom animations, and utility classes for the app.",
  "frontend/src/lib/utils.ts": "Exports a cn helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/steps/BigQuestionStep.tsx": "A step component showing a playful Valentine question with moving buttons and a popup modal.",
  "frontend/src/steps/FinalStep.tsx": "Displays the final Valentine message with decorative effects and a share footer.",
  "frontend/src/steps/RoseDayStep.tsx": "Shows a Rose Day card with an image and navigation to the next step.",
  "frontend/src/steps/SurpriseEnvelopesStep.tsx": "Renders interactive red envelopes that reveal surprises and leads to the final step.",
  "frontend/src/steps/ValentineNoteStep.tsx": "Displays a toggleable Valentine note in a pink envelope and a button to proceed.",
  "frontend/src/steps/WelcomeStep.tsx": "Initial welcome screen with a puppy image and a button to continue.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, plugins, and content paths.",
  "project_state.json": "Describes the current romantic multi‑step website state, requested content updates, page‑flow reorder, and interactive elements. Also lists existing features, architectural notes, and known scope conflicts."
}